[
    "There are over 5,000 species of known frogs, and scientists continue to discover new species. Frog species come in a variety of sizes and colors. They can be found in a variety of habitats on every continent except Antarctica. Frogs are amphibians, which are cold-blooded vertebrates, meaning they have backbones, that don’t have scales. Amphibians live both on land and in water. Other amphibians include salamander, newt, and caecilian.",
    "What’s the difference between frogs and toads? There isn’t a difference, the word “frog” includes both frogs and toads. While toads are frogs, toads tend to reference a frog that has particularly dry and warty skin. Toads also tend to have shorter legs and are more heavy-set. Frogs are more likely to live in or near water than toads.",
    "Frogs vary widely in size and weight depending on species. For example, the West African goliath frog can grow to 15 inches and weigh as much as 7 pounds. Meanwhile, the Cuban tree frog grows to only half an inch and weighs approximately 2 ounces.",
    "Frogs and toads have almost non-existent necks. However, most species have large, protruding eyes so they can see in most directions without needing to turn their head. Most species are also great at hopping in any direction. They have powerful muscles in their back legs, allowing them to hop great distances. Some frogs can jump over 20 times their own body length, which is similar to a human jumping 30 meters. In comparison, Olympian Mike Powell holds the long jump record of 8.95 meters.",
    "Frogs come in a variety of colors, but they have two main color schemes. Both color schemes are used for different survival techniques. The mottled green and brown colors are used for camouflage, so predators have a more difficult time spotting them. Meanwhile, the bright colors, like those of the poison frog, signal a warning sign to predators that their skin is toxic. Some South African frogs are so poisonous that you can die from them. Other frogs like the smooth-sided toad have glands behind the eyes that produce powerful toxins that kill anything that tries to eat them.",
    "Frogs and toads have a moist and permeable skin layer covered with mucous glands. They are able to breathe through their skin in addition to their lungs. The thin layer of mucous keeps their skin moist and protects them from scratches.",
    "Most species eat insects, spiders, worms, and slugs. However, some of the larger species are able to eat larger prey like mice, birds, and small reptiles. Their skin absorbs water so they don’t need to drink water. Frogs help keep a large part of the world’s insect population under control.",
    "Frogs thrive in a large number of environments from tropical forests to frozen tundras to deserts. Their skin requires freshwater, so most frogs live in aquatic and swampy habitats. There are a number of exceptions, including the waxy tree frog, which can be found in the arid region of Gran Chaco of South America. Waxy tree frogs produce a waxy substance that they rub all over their skin to prevent evaporation.",
    "Frogs can be found on every continent except Antarctica.",
    "Male frogs make calls to attract the females during the mating season. The female will choose a male whose call she likes, and the male will grab her as she releases her eggs in a mating hug called amplexus. Almost all frog species fertilize the eggs outside the female’s body. Amplexus can last hours, days, or in some species like the Andean toad, months. The mother will lay two to more than 50,000 eggs depending on the species.",
    "In many species, the male will guard the eggs. He may transport them on his back, in a pouch in his belly, or in his mouth to a safe location until they hatch into tadpoles. Although the father is more likely to perform this task, the mother also performs these tasks in some species. In some cases, both parents will take turns babysitting the eggs.",
    "Certain species have different breeding rituals. For example, the marsupial frog keeps her eggs in a pouch like a kangaroo. Meanwhile, the Suriname toad of South America keeps her young embedded in the skin of her back. The gastric-brooding frog of Australia swallows her fertilized eggs until she releases them when they hatch.",
    "After about two to three weeks, depending on the species, the eggs hatch into tadpoles. Tadpoles, also known as pollywogs, have gills and a tail like a fish but a round head. Over the course of a few months, the tadpoles will gradually grow legs, absorb their tails, lose their gills, and turn into frogs that start breathing air and hopping. This process is called metamorphosis. While most frogs metamorphose in a few months, some species take longer. For example, the mountain yellow-legged frog takes at least two seasons to morph, due to the cold temperatures and short summer season where it lives.",
    "Frogs are social creatures and live in groups called armies, colonies, or knots. Similar to fish, young frogs will swim together in schools. Each species of frog has a unique call, which is used to attract a mate or to warn enemies. During the mating season, the male frogs croak loudly in a group. Some frog calls can be heard up to a mile away.",
    "The life spans of frogs in the wild are widely unknown, but likely range from one day to 30 years. In captivity, frogs have been known to live more than 20 years.",
    "The largest threat to frog species is habitat loss related to human activity and human expansion. For migrating frogs, the increased number of roads and infrastructure through their habitats have increased the number of roadkill. Humans have introduced nonnative species like trout and even other frogs to certain habitats that eat many of the native frogs. Pollutants from human activity often contaminate the rivers and ponds of frogs, killing local frog and tadpole populations.",
    "One major threat to frog populations is the spread of a fungus called chytrid (Batrachochytrium dendrobatidis). The disease led to the catastrophic decline or extinction of at least 200 species of frogs and other amphibians. The fungus lives in water, so frogs are easily infected. The fungus covers their thin skin so the frog can’t breathe or get water. Not only does the fungus affect the frog, but it also affects larvae and tadpoles, growing on their mouthparts and preventing them from eating.",
    "Many species of frogs, nearly 900 species, are listed as “Endangered” by IUCN’s Red List. Over 500 species of frogs are listed as “Critically Endangered.” The world is currently facing an amphibian extinction crisis. According to IUCN, 41% of the world’s amphibians are threatened with extinction."
]